
## Plan Result (infrastructure)

[CI link](https://github.com/nangashi/dcr/actions/runs/7223242814)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * awscc_chatbot_slack_channel_configuration.notification_chatbot
* Update
  * awscc_iam_role.notification_chatbot


<details><summary>Change Result (Click me)</summary>

```hcl

  # awscc_chatbot_slack_channel_configuration.notification_chatbot will be created
  + resource "awscc_chatbot_slack_channel_configuration" "notification_chatbot" {
      + arn                = (known after apply)
      + configuration_name = "Chatbot-prd"
      + iam_role_arn       = "arn:aws:iam::384081048358:role/ChatBotChannelRole-prd"
      + id                 = (known after apply)
      + logging_level      = "ERROR"
      + slack_channel_id   = "C068DKBREHG"
      + slack_workspace_id = "T01JC6ZPQGG"
      + sns_topic_arns     = [
          + "arn:aws:sns:ap-northeast-1:384081048358:SlackNotification-prd",
        ]
      + user_role_required = (known after apply)
    }

  # awscc_iam_role.notification_chatbot will be updated in-place
  ~ resource "awscc_iam_role" "notification_chatbot" {
        id                          = "ChatBotChannelRole-prd"
      - max_session_duration        = 3600 -> null
      ~ policies                    = [
          ~ {
              ~ policy_document = jsonencode( # whitespace changes
                    {
                        Statement = [
                            {
                                Action   = "sns:Subscribe"
                                Effect   = "Allow"
                                Resource = "arn:aws:sns:ap-northeast-1:384081048358:SlackNotification-prd"
                            },
                        ]
                        Version   = "2012-10-17"
                    }
                )
                # (1 unchanged attribute hidden)
            },
        ]
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":33,"Program":"tfcmt","SHA1":"7a59f99cd26099f353eb35d960122a73c97a2ba2","Target":"infrastructure","Vars":{},"WorkflowName":"Check Pull Requests"} -->